In [47]:
#importo librerias necesarias

import numpy as np 
import pandas as pd

In [48]:
obj_df = pd.read_csv("distribucion_medioempleado_sexoyedad.csv", sep=";")
obj_df.head(22)

   Medio empleado         Sexo                Edad     Total
0           Total  Ambos sexos    Todas las edades  1.000,00
1           Total  Ambos sexos  Menores de 15 años      3,53
2           Total  Ambos sexos     De 15 a 19 años     13,59
3           Total  Ambos sexos     De 20 a 24 años     22,29
4           Total  Ambos sexos     De 25 a 29 años     38,33
5           Total  Ambos sexos     De 30 a 34 años     47,57
6           Total  Ambos sexos     De 35 a 39 años     75,29
7           Total  Ambos sexos     De 40 a 44 años     93,50
8           Total  Ambos sexos     De 45 a 49 años     99,76
9           Total  Ambos sexos     De 50 a 54 años    114,43
10          Total  Ambos sexos     De 55 a 59 años     98,40
11          Total  Ambos sexos     De 60 a 64 años     68,23
12          Total  Ambos sexos     De 65 a 69 años     62,52
13          Total  Ambos sexos     De 70 a 74 años     66,59
14          Total  Ambos sexos     De 75 a 79 años     55,45
15          Total  Ambos sexos     De 80 a 84 años     70,40
16          Total  Ambos sexos     De 85 a 89 años     48,93
17          Total  Ambos sexos     De 90 a 94 años     17,40
18          Total  Ambos sexos    De 95 años y más      3,81
19          Total      Hombres    Todas las edades    738,79
20          Total      Hombres  Menores de 15 años      1,63
21          Total      Hombres     De 15 a 19 años      8,97

In [49]:
data = obj_df.iloc[20:]
data

,Medio empleado,Sexo,Edad,Total
20,Total,Hombres,Menores de 15 años,"1,63"
21,Total,Hombres,De 15 a 19 años,"8,97"
22,Total,Hombres,De 20 a 24 años,"17,94"
23,Total,Hombres,De 25 a 29 años,"28,54"
24,Total,Hombres,De 30 a 34 años,"39,14"
...,...,...,...,...
1477,X84. Lesión autoinfligida intencionalmente por...,Mujeres,De 75 a 79 años,"0,27"
1478,X84. Lesión autoinfligida intencionalmente por...,Mujeres,De 80 a 84 años,"0,82"
1479,X84. Lesión autoinfligida intencionalmente por...,Mujeres,De 85 a 89 años,"0,54"
1480,X84. Lesión autoinfligida intencionalmente por...,Mujeres,De 90 a 94 años,"0,00"
1481,X84. Lesión autoinfligida intencionalmente por...,Mujeres,De 95 años y más,"0,00"

In [50]:
data.shape  # esta es la cantidad de filas y columanas que tiene mi DataFrame, ahora empiezo a limpiar los datos.

(1462, 4)

In [51]:
data.dtypes #los datos son de tipo objeto, son datos categoricos que los tengo que cambiar.

Medio empleado    object
Sexo              object
Edad              object
Total             object
dtype: object

In [52]:
data["Medio empleado"].value_counts()

X83. Lesión autoinfligida intencionalmente por otros medios especificados                                                                                                                57
X69. Envenenamiento autoinfligido intencionalmente por (exposición a) otros productos químicos y sustancias nocivas, y los no especificados                                              57
X66. Envenenamiento autoinfligido intencionalmente por (exposición a) disolventes orgánicos e hidrocarburos halogenados y sus vapores                                                    57
X70. Lesión autoinfligida intencionalmente por ahorcamiento, estrangulamiento o sofocación                                                                                               57
X73. Lesión autoinfligida intencionalmente por disparo de rifle, escopeta y arma larga                                                                                                   57
X72. Lesión autoinfligida intencionalmente por disparo de arma corta                                                                                                                     57
X64. Envenenamiento autoinfligido intencionalmente por (exposición a) otras drogas, medicamentos y sustancias biológicas, y los no especificados                                         57
X79. Lesión autoinfligida intencionalmente por objeto romo o sin filo                                                                                                                    57
X76. Lesión autoinfligida intencionalmente por humo, fuego y llamas                                                                                                                      57
X61. Envenenamiento autoinfligido intencionalmente por (exposición a) drogas antiepilépticas, sedantes, hipnóticas, antiparkinsonianas y psicotrópicas, no clasificadas en otra parte    57
X65. Envenenamiento autoinfligido intencionalmente por (exposición a) alcohol                                                                                                            57
X60. Envenenamiento autoinfligido intencionalmente por (exposición a) analgésicos no narcóticos, antipiréticos y antirreumáticos                                                         57
X78. Lesión autoinfligida intencionalmente por objeto cortante                                                                                                                           57
X81. Lesión autoinfligida intencionalmente por arrojarse o colocarse delante de objeto en movimiento                                                                                     57
X71. Lesión autoinfligida intencionalmente por ahogamiento y sumersión                                                                                                                   57
X68. Envenenamiento autoinfligido intencionalmente por (exposición a) plaguicidas                                                                                                        57
X67. Envenenamiento autoinfligido intencionalmente por (exposición a) otros gases y vapores                                                                                              57
X84. Lesión autoinfligida intencionalmente por medios no especificados                                                                                                                   57
X75. Lesión autoinfligida intencionalmente por material explosivo                                                                                                                        57
X82. Lesión autoinfligida intencionalmente por colisión de vehículo de motor                                                                                                             57
X63. Envenenamiento autoinfligido intencionalmente por (exposición a) otras drogas que actúan sobre el sistema nervioso autónomo                                                         57
X74. Lesión autoinfligida intencionalmente por disparo de otras armas de fuego, y las no especificadas                                                                                   57
X62. Envenenamiento autoinfligido intencionalmente por (exposición a) narcóticos y psicodislépticos, no clasificados en otra parte                                                       57
X77. Lesión autoinfligida intencionalmente por vapor de agua, otros vapores y objetos calientes                                                                                          57
X80. Lesión autoinfligida intencionalmente al saltar desde un lugar elevado                                                                                                              57
Total                                                                                                                                                                                    37
Name: Medio empleado, dtype: int64

In [53]:
#Para nuestros usos, vamos a crear un diccionario de asignación que contiene cada columna para procesar, así como un diccionario de los valores a traducir. replace

cleanup_nums = {"Medio empleado": {"Total": 0, "X83. Lesión autoinfligida intencionalmente por otros medios especificados": 83, "X69. Envenenamiento autoinfligido intencionalmente por (exposición a) otros productos químicos y sustancias nocivas, y los no especificados": 69,
"X66. Envenenamiento autoinfligido intencionalmente por (exposición a) disolventes orgánicos e hidrocarburos halogenados y sus vapores": 66, 
"X70. Lesión autoinfligida intencionalmente por ahorcamiento, estrangulamiento o sofocación": 70,
"X73. Lesión autoinfligida intencionalmente por disparo de rifle, escopeta y arma larga": 73,
"X72. Lesión autoinfligida intencionalmente por disparo de arma corta": 72, 
"X64. Envenenamiento autoinfligido intencionalmente por (exposición a) otras drogas, medicamentos y sustancias biológicas, y los no especificados": 64,
"X79. Lesión autoinfligida intencionalmente por objeto romo o sin filo": 79, 
"X76. Lesión autoinfligida intencionalmente por humo, fuego y llamas": 76, 
"X61. Envenenamiento autoinfligido intencionalmente por (exposición a) drogas antiepilépticas, sedantes, hipnóticas, antiparkinsonianas y psicotrópicas, no clasificadas en otra parte" : 61,
"X65. Envenenamiento autoinfligido intencionalmente por (exposición a) alcohol": 65,
"X60. Envenenamiento autoinfligido intencionalmente por (exposición a) analgésicos no narcóticos, antipiréticos y antirreumáticos": 60, 
"X78. Lesión autoinfligida intencionalmente por objeto cortante" : 78,
"X81. Lesión autoinfligida intencionalmente por arrojarse o colocarse delante de objeto en movimiento" : 81,
"X71. Lesión autoinfligida intencionalmente por ahogamiento y sumersión": 71,
"X68. Envenenamiento autoinfligido intencionalmente por (exposición a) plaguicidas" : 68,
"X67. Envenenamiento autoinfligido intencionalmente por (exposición a) otros gases y vapores": 67,
"X84. Lesión autoinfligida intencionalmente por medios no especificados" : 84,
"X75. Lesión autoinfligida intencionalmente por material explosivo" : 75,
"X82. Lesión autoinfligida intencionalmente por colisión de vehículo de motor": 82,
"X63. Envenenamiento autoinfligido intencionalmente por (exposición a) otras drogas que actúan sobre el sistema nervioso autónomo" : 63,
"X74. Lesión autoinfligida intencionalmente por disparo de otras armas de fuego, y las no especificadas": 74,
"X62. Envenenamiento autoinfligido intencionalmente por (exposición a) narcóticos y psicodislépticos, no clasificados en otra parte": 62,
"X77. Lesión autoinfligida intencionalmente por vapor de agua, otros vapores y objetos calientes": 77,
"X80. Lesión autoinfligida intencionalmente al saltar desde un lugar elevado": 80},
"Edad": { "Todas las edades": 0,"Menores de 15 años" : 1,"De 15 a 19 años":2, "De 20 a 24 años" : 3, "De 25 a 29 años": 4,
"De 30 a 34 años": 5, "De 35 a 39 años" : 6, "De 40 a 44 años": 7, "De 45 a 49 años": 8,
"De 50 a 54 años": 9, "De 55 a 59 años": 10, "De 60 a 64 años": 11, "De 65 a 69 años": 12, "De 70 a 74 años": 13, "De 75 a 79 años": 14, "De 80 a 84 años": 15, "De 85 a 89 años": 16, "De 90 a 94 años": 17, "De 95 años y más": 18}}

In [54]:
# Para convertir las columnas en números utilizando: replace

nuevo_data = data.replace(cleanup_nums)
nuevo_data

      Medio empleado     Sexo  Edad  Total
20                 0  Hombres     1   1,63
21                 0  Hombres     2   8,97
22                 0  Hombres     3  17,94
23                 0  Hombres     4  28,54
24                 0  Hombres     5  39,14
...              ...      ...   ...    ...
1477              84  Mujeres    14   0,27
1478              84  Mujeres    15   0,82
1479              84  Mujeres    16   0,54
1480              84  Mujeres    17   0,00
1481              84  Mujeres    18   0,00

[1462 rows x 4 columns]

In [57]:
nuevo_data["Sexo"].value_counts()

Mujeres        494
Hombres        493
Ambos sexos    475
Name: Sexo, dtype: int64

In [60]:
Rango_sexo = {"Sexo": {"Ambos sexos": 0, "Hombres": 1, "Mujeres": 2}}

nuevo_data_sex = nuevo_data.replace(Rango_sexo)
nuevo_data_sex

      Medio empleado  Sexo  Edad  Total
20                 0     1     1   1,63
21                 0     1     2   8,97
22                 0     1     3  17,94
23                 0     1     4  28,54
24                 0     1     5  39,14
...              ...   ...   ...    ...
1477              84     2    14   0,27
1478              84     2    15   0,82
1479              84     2    16   0,54
1480              84     2    17   0,00
1481              84     2    18   0,00

[1462 rows x 4 columns]

In [61]:
nuevo_data_sex.dtypes #ya solo me queda por cambiar, la columna total, que tiene coma, remplazarla por "."

Medio empleado     int64
Sexo               int64
Edad               int64
Total             object
dtype: object

In [65]:
nuevo_data_sex["Total"]= nuevo_data_sex["Total"].apply(lambda x:x.replace(",", "."))

In [66]:
nuevo_data_sex

      Medio empleado  Sexo  Edad  Total
20                 0     1     1   1.63
21                 0     1     2   8.97
22                 0     1     3  17.94
23                 0     1     4  28.54
24                 0     1     5  39.14
...              ...   ...   ...    ...
1477              84     2    14   0.27
1478              84     2    15   0.82
1479              84     2    16   0.54
1480              84     2    17   0.00
1481              84     2    18   0.00

[1462 rows x 4 columns]

In [73]:
nuevo_data_sex["Total"]= nuevo_data_sex["Total"].apply(lambda x: float(x))

In [74]:
nuevo_data_sex["Total"]

20       1.63
21       8.97
22      17.94
23      28.54
24      39.14
        ...
1477     0.27
1478     0.82
1479     0.54
1480     0.00
1481     0.00
Name: Total, Length: 1462, dtype: float64

In [77]:
#le asigno otro nombre. y lo guardo 
nuevo_data_sex.to_csv('df_cleaned.csv')